{
  "title": "Guidelines for the supervised learning of species interactions",
  "authors": [
    {
      "affiliations": [
        "Université de Montréal",
        "Québec Centre for Biodiversity Sciences"
      ],
      "familyname": "Poisot",
      "givennames": "Timothée",
      "email": "timothee.poisot@umontreal.ca",
      "orcid": "0000-0002-0735-5184",
      "status": ["corresponding"]
    }
  ],
  "abstract": [
    "The prediction of species interaction networks is gaining momentum as a way to circumvent limitations in data volume. Yet, ecological networks are challenging to predict because they are typically small and sparse. Dealing with extreme class imbalance is a challenge for most binary classifiers, and there are currently no guidelines as to how predictive models can be trained.",
    "Using simple mathematical arguments and numerical experiments in which a variety of classifiers (for supervised learning) are trained on simulated networks, we develop a series of guidelines related to the choice of measures to use for model selection, and the degree of unbiasing to apply to the training dataset.",
    "Classifier accuracy and the ROC-AUC are not informative measures for the performance of interaction prediction. PR-AUC is a fairer assesment of performance. In some cases, even standard measures can lead to selecting a more biased classifier because the effect of connectance is strong. The amount of correction to apply to the training dataset depends as a function of the classifier and the network connectance.",
    "These results reveal that training machines to predict networks is a challenging task, and that in virtually all cases, the composition of the training set needs to be experimented on before performing the actual training. We discuss these consequences in the context of the low volume of data."
  ],
  "keywords": [
    "species interaction networks",
    "binary classifiers",
    "machine learning",
    "regression",
    "supervised learning"
  ],
  "citationstyle": "methods-in-ecology-and-evolution"
}